test-results/ab_summary_20250731_183648.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Apache/2.4.58
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        2911 bytes

Concurrency Level:      5
Time taken for tests:   0.024 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      159150 bytes
HTML transferred:       145550 bytes
Requests per second:    2126.94 [#/sec] (mean)
Time per request:       2.351 [ms] (mean)
Time per request:       0.470 [ms] (mean, across all concurrent requests)
Transfer rate:          6611.36 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:     1    1   0.7      1       3
Waiting:        0    1   0.7      1       3
Total:          1    2   0.8      2       5

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      3
  90%      3
  95%      4
  98%      5
  99%      5
 100%      5 (longest request)