test-results/ab_summary_20250731_185241.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        nginx/1.29.0
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        3509 bytes

Concurrency Level:      5
Time taken for tests:   0.090 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      191250 bytes
HTML transferred:       175450 bytes
Requests per second:    557.72 [#/sec] (mean)
Time per request:       8.965 [ms] (mean)
Time per request:       1.793 [ms] (mean, across all concurrent requests)
Transfer rate:          2083.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      0       6
Processing:     2    7   6.4      6      32
Waiting:        1    7   6.3      5      32
Total:          2    8   7.3      6      37

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      8
  75%      9
  80%     10
  90%     23
  95%     24
  98%     37
  99%     37
 100%     37 (longest request)